# Task 3
#list version
my_list = [0, 'Зима', 'Весна', 'Весна', 'Весна', 'Лето', 'Лето', 'Лето', 'Осень', 'Осень', 'Осень', 'Зима']
imon = int(input('Введите номер месяца: '))
if 0 < imon < 13:
    print('Это', my_list[imon])
else:
    print('Нет такого месяца')

# dict version
my_dict = {1:'Зима', 12:'Зима', 2:'Зима',
           3:'Весна', 4:'Весна', 5:'Весна',
           6:'Лето', 7:'Лето', 8:'Лето',
           9:'Осень', 10:'Осень', 11:'Осень'}
imon = int(input('Введите номер месяца: '))
print('Это', my_dict.get(imon))
